OF21x/ALM22/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


  libs
  (
    "pisoFoamTurbine.so"
  );

  application       pisoFoamTurbine;

  startFrom         latestTime;

  startTime         0.0;

  stopAt            endTime;

  endTime           300.0;

  deltaT            0.01;

  writeControl      adjustableRunTime;

  writeInterval     50;

  purgeWrite        1;

  writeFormat       binary;

  writePrecision    12;

  writeCompression  compressed;

  timeFormat        general;

  timePrecision     12;

  runTimeModifiable yes;

  adjustTimeStep    no;

  maxCo             0.75;

  maxDeltaT         25.0;

  startTimeMean    330;

  startTimeCorr    660;

  functions
  {

  }


// ************************************************************************* //
