OF21x/ALM22/constant/airfoilProperties/DU191-OF
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

airfoilData
(
//alpha   C_l      C_d

( -180 0 0.0193233333333333 )
( -175 0.381333333333333 0.03377 )
( -170 0.7633 0.0951333333333333 )
( -160 0.663033333333333 0.280773333333333 )
( -155 0.740766666666667 0.392376666666667 )
( -150 0.788133333333333 0.509553333333333 )
( -145 0.8085 0.62824 )
( -140 0.8035 0.744826666666667 )
( -135 0.7765 0.85645 )
( -130 0.7295 0.960736666666667 )
( -125 0.6655 1.05578666666667 )
( -120 0.5865 1.13993666666667 )
( -115 0.496133333333333 1.21198666666667 )
( -110 0.394766666666667 1.27106333333333 )
( -105 0.2864 1.31630333333333 )
( -100 0.172666666666667 1.34730666666667 )
( -95 0.0549333333333333 1.3638 )
( -90 -0.0644333333333333 1.36555666666667 )
( -85 -0.182166666666667 1.35264 )
( -80 -0.297533333333333 1.32525 )
( -75 -0.408266666666667 1.28372333333333 )
( -70 -0.512 1.22842333333333 )
( -65 -0.606733333333333 1.16027666666667 )
( -60 -0.690466666666667 1.07999333333333 )
( -55 -0.760833333333333 0.9888 )
( -50 -0.8162 0.888233333333333 )
( -45 -0.852566666666667 0.779993333333333 )
( -40 -0.8693 0.66628 )
( -35 -0.8633 0.549793333333333 )
( -30 -0.8323 0.433533333333333 )
( -25 -0.830266666666667 0.313883333333333 )
( -24 -0.842133333333333 0.288696666666667 )
( -23 -0.858833333333333 0.263153333333333 )
( -22 -0.878 0.237363333333333 )
( -21 -0.900633333333333 0.211553333333333 )
( -20 -0.925366666666667 0.18576 )
( -19 -0.951566666666667 0.16022 )
( -18 -0.977866666666667 0.134996666666667 )
( -17 -1.03873333333333 0.109566666666667 )
( -16 -1.0712 0.0842466666666667 )
( -15 -1.0786 0.0591466666666667 )
( -14.5 -1.07628333333333 0.0466933333333333 )
( -12.01 -0.922669666666667 0.0184341 )
( -11 -0.8411 0.0187733333333333 )
( -9.98 -0.752064 0.0175381333333333 )
( -8.12 -0.508158666666667 0.0103708 )
( -7.62 -0.449178 0.00963966666666667 )
( -7.11 -0.388775666666667 0.00885483333333333 )
( -6.6 -0.327813333333333 0.00838866666666667 )
( -6.5 -0.316383333333333 0.00858333333333334 )
( -6 -0.257033333333333 0.0082 )
( -5.5 -0.196683333333333 0.00781166666666667 )
( -5 -0.137066666666667 0.00753333333333333 )
( -4.5 -0.0708 0.007165 )
( -4 -0.00489999999999998 0.00687 )
( -3.5 0.0518166666666667 0.00654333333333333 )
( -3 0.1089 0.00618 )
( -2.5 0.171583333333333 0.00582666666666667 )
( -2 0.2339 0.00551 )
( -1.5 0.293416666666667 0.00544666666666667 )
( -1 0.352933333333333 0.00538333333333333 )
( -0.5 0.411766666666667 0.00538333333333333 )
( 0 0.470966666666667 0.00538333333333333 )
( 0.5 0.5298 0.00538333333333333 )
( 1 0.588633333333333 0.00542 )
( 1.5 0.6471 0.00545166666666667 )
( 2 0.705933333333333 0.00552 )
( 2.5 0.764033333333333 0.00559333333333333 )
( 3 0.822133333333333 0.00566666666666667 )
( 3.5 0.880233333333333 0.00580833333333333 )
( 4 0.933933333333333 0.00602333333333333 )
( 4.5 0.98805 0.00644333333333333 )
( 5 1.0418 0.00697333333333333 )
( 5.5 1.08926666666667 0.008495 )
( 6 1.13563333333333 0.00990666666666667 )
( 6.5 1.17756666666667 0.0109333333333333 )
( 7 1.2184 0.01196 )
( 7.5 1.2575 0.0126016666666667 )
( 8 1.29403333333333 0.0132433333333333 )
( 8.5 1.32673333333333 0.0140266666666667 )
( 9 1.35423333333333 0.01525 )
( 9.5 1.3725 0.0167933333333333 )
( 10 1.3732 0.01885 )
( 10.5 1.3681 0.0279466666666667 )
( 11 1.36806666666667 0.03698 )
( 11.5 1.36963333333333 0.0462433333333333 )
( 12 1.3746 0.0559833333333333 )
( 12.5 1.38066666666667 0.0660266666666667 )
( 13 1.38573333333333 0.0764733333333333 )
( 13.5 1.387 0.0868933333333333 )
( 14 1.38346666666667 0.0970033333333333 )
( 14.5 1.3813 0.10748 )
( 15 1.38266666666667 0.1177 )
( 15.5 1.38613333333333 0.127956666666667 )
( 16 1.38786666666667 0.13847 )
( 16.5 1.38973333333333 0.149103333333333 )
( 17 1.3896 0.1596 )
( 17.5 1.39096666666667 0.170023333333333 )
( 18 1.39666666666667 0.180583333333333 )
( 18.5 1.3992 0.19129 )
( 19 1.39666666666667 0.202016666666667 )
( 19.5 1.38996666666667 0.212753333333333 )
( 20 1.3851 0.223526666666667 )
( 20.5 1.38168333333333 0.234351666666667 )
( 21 1.37276666666667 0.245213333333333 )
( 22 1.32893333333333 0.2689 )
( 23 1.27396666666667 0.292406666666667 )
( 24 1.20606666666667 0.315743333333333 )
( 25 1.15626666666667 0.33748 )
( 26 1.10756666666667 0.359433333333333 )
( 28 1.01573333333333 0.4037 )
( 30 0.9392 0.44843 )
( 32 0.885066666666667 0.49342 )
( 35 0.8539 0.561843333333333 )
( 40 0.857533333333333 0.679813333333333 )
( 45 0.8425 0.7958 )
( 50 0.807366666666667 0.907356666666667 )
( 55 0.755133333333333 1.01252666666667 )
( 60 0.6868 1.10974333333333 )
( 65 0.605466666666667 1.19767 )
( 70 0.5115 1.27529666666667 )
( 75 0.4079 1.34159666666667 )
( 80 0.295766666666667 1.39531 )
( 85 0.1771 1.43476333333333 )
( 90 0.053 1.45455666666667 )
( 95 -0.0736333333333333 1.45135666666667 )
( 100 -0.198633333333333 1.43263 )
( 105 -0.320266666666667 1.39856666666667 )
( 110 -0.435266666666667 1.34944 )
( 115 -0.542266666666667 1.28575 )
( 120 -0.6389 1.20836 )
( 125 -0.7219 1.11817 )
( 130 -0.7889 1.01661666666667 )
( 135 -0.838533333333333 0.905263333333333 )
( 140 -0.866533333333333 0.786146666666667 )
( 145 -0.8709 0.661893333333333 )
( 150 -0.8489 0.535676666666667 )
( 155 -0.7969 0.411123333333333 )
( 160 -0.7129 0.29277 )
( 170 -0.7633 0.0970266666666667 )
( 175 -0.381333333333333 0.0334 )
( 180 0 0.0193233333333333 )
); // // // //
