OF21x/ALM22/constant/airfoilProperties/DU219-OF
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

airfoilData
(
//alpha   C_l      C_d

( -180 0 0.01932 )
( -175 0.382 0.03358 )
( -170 0.7639 0.09473 )
( -160 0.6715 0.28157 )
( -155 0.7507 0.39413 )
( -150 0.7989 0.5124 )
( -145 0.8198 0.63235 )
( -140 0.8149 0.75021 )
( -135 0.7878 0.86315 )
( -130 0.7407 0.96867 )
( -125 0.6765 1.06486 )
( -120 0.5973 1.15014 )
( -115 0.506 1.22328 )
( -110 0.4038 1.28329 )
( -105 0.2946 1.32937 )
( -100 0.1793 1.36113 )
( -95 0.0601 1.37816 )
( -90 -0.0601 1.38036 )
( -85 -0.1794 1.36773 )
( -80 -0.2957 1.34048 )
( -75 -0.4079 1.29898 )
( -70 -0.5131 1.24357 )
( -65 -0.6094 1.17503 )
( -60 -0.6945 1.09427 )
( -55 -0.7657 1.00238 )
( -50 -0.8218 0.90097 )
( -45 -0.859 0.79174 )
( -40 -0.877 0.6769 )
( -35 -0.871 0.55914 )
( -30 -0.84 0.44148 )
( -25 -0.7951 0.32661 )
( -24 -0.7998 0.30264 )
( -23 -0.8127 0.27804 )
( -22 -0.8308 0.25306 )
( -21 -0.855 0.2278 )
( -20 -0.8834 0.20235 )
( -19 -0.9158 0.17698 )
( -18 -0.9504 0.15169 )
( -17 -0.9861 0.12674 )
( -16 -1.0236 0.10214 )
( -15.25 -1.05105 0.0841475 )
( -14.24 -1.0587843373494 0.062858313253012 )
( -13.24 -1.01562409638554 0.0501795180722891 )
( -12.22 -0.97026265060241 0.0371467469879518 )
( -11.22 -0.916890099009901 0.0355026732673267 )
( -10.19 -0.844526470588235 0.0335264705882353 )
( -9.7 -0.787074193548387 0.0304616129032258 )
( -9.18 -0.708554838709677 0.0255703225806451 )
( -8.18 -0.566448387096774 0.0143332258064516 )
( -7.19 -0.433147058823529 0.01032 )
( -6.65 -0.358476470588235 0.00920941176470588 )
( -6.13 -0.290144 0.0090638 )
( -6 -0.273 0.00855 )
( -5.5 -0.2053 0.00771 )
( -5 -0.1399 0.00718 )
( -4.5 -0.0746 0.00677 )
( -4 -0.0106999999999999 0.00658 )
( -3.5 0.0531000000000001 0.00638 )
( -3 0.1185 0.00611 )
( -2.5 0.1821 0.00601 )
( -2 0.2447 0.00601 )
( -1.5 0.3082 0.00601 )
( -1 0.3716 0.00601 )
( -0.5 0.4341 0.00601 )
( 0 0.4977 0.006 )
( 0.5 0.5601 0.006 )
( 1 0.6226 0.0061 )
( 1.5 0.6841 0.00611 )
( 2 0.7466 0.00621 )
( 2.5 0.8071 0.0064 )
( 3 0.8677 0.00659 )
( 3.5 0.9281 0.00687 )
( 4 0.9779 0.00734 )
( 4.5 1.0293 0.00807 )
( 5 1.0799 0.00907 )
( 5.5 1.1313 0.01026 )
( 6 1.18 0.01118 )
( 6.5 1.2286 0.01201 )
( 7 1.2744 0.01286 )
( 7.5 1.3172 0.01363 )
( 8 1.3527 0.01448 )
( 9 1.4017 0.01784 )
( 9.5 1.4033 0.0207 )
( 10 1.368 0.02487 )
( 10.5 1.3305 0.02928 )
( 11 1.3095 0.03378 )
( 11.5 1.2999 0.03916 )
( 12 1.2997 0.04582 )
( 12.5 1.3015 0.05357 )
( 13 1.2927 0.06327 )
( 13.5 1.2855 0.07282 )
( 14 1.2802 0.08185 )
( 14.5 1.2793 0.09181 )
( 15 1.2808 0.10122 )
( 15.5 1.2855 0.1109 )
( 16 1.2885 0.12122 )
( 16.5 1.299 0.13173 )
( 17 1.3075 0.14215 )
( 17.5 1.3103 0.1522 )
( 18 1.3105 0.16244 )
( 18.5 1.3112 0.173 )
( 19 1.3134 0.18385 )
( 19.5 1.3145 0.19486 )
( 20 1.3197 0.20572 )
( 20.5 1.3351 0.21714 )
( 21 1.3353 0.22869 )
( 22 1.2911 0.25737 )
( 23 1.2458 0.28631 )
( 24 1.2014 0.31568 )
( 25 1.1578 0.34537 )
( 26 1.1169 0.375 )
( 28 1.0446 0.43397 )
( 30 0.9923 0.4916 )
( 32 0.9686 0.54696 )
( 35 0.9787 0.62581 )
( 40 0.9808 0.75534 )
( 45 0.9569 0.88009 )
( 50 0.9102 0.99715 )
( 55 0.8438 1.10393 )
( 60 0.7592 1.19811 )
( 65 0.6613 1.2782 )
( 70 0.5517 1.34294 )
( 75 0.4334 1.39151 )
( 80 0.3098 1.42362 )
( 85 0.1832 1.44003 )
( 90 0.0569 1.44546 )
( 95 -0.0687 1.44263 )
( 100 -0.1932 1.42444 )
( 105 -0.3138 1.3909 )
( 110 -0.4285 1.34239 )
( 115 -0.5352 1.27942 )
( 120 -0.6311 1.20276 )
( 125 -0.714 1.11332 )
( 130 -0.781 1.01258 )
( 135 -0.8301 0.90203 )
( 140 -0.8583 0.78376 )
( 145 -0.8636 0.66026 )
( 150 -0.842 0.53478 )
( 155 -0.7905 0.41084 )
( 160 -0.7072 0.29298 )
( 170 -0.7639 0.09772 )
( 175 -0.382 0.03394 )
( 180 0 0.01932 )
); // // // //
