OF21x/ALM22/constant/airfoilProperties/DU357-OF
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

airfoilData
(
//alpha   C_l      C_d

( -180 0 0.04343 )
( -175 0.2223 0.053388 )
( -170 0.40388 0.106228 )
( -160 0.65576 0.299082 )
( -155 0.73048 0.412912 )
( -150 0.77506 0.531458 )
( -145 0.79178 0.650748 )
( -140 0.7835 0.767382 )
( -135 0.75336 0.878388 )
( -130 0.70408 0.981466 )
( -125 0.63708 1.074816 )
( -120 0.55608 1.156866 )
( -115 0.46308 1.226516 )
( -110 0.36108 1.282866 )
( -105 0.25122 1.325216 )
( -100 0.1355 1.353194 )
( -95 0.01778 1.3664 )
( -90 -0.10108 1.36492 )
( -85 -0.2188 1.348768 )
( -80 -0.33352 1.318244 )
( -75 -0.4431 1.273576 )
( -70 -0.54582 1.21545 )
( -65 -0.63926 1.144652 )
( -60 -0.72098 1.062024 )
( -55 -0.78856 0.968852 )
( -50 -0.84028 0.866636 )
( -45 -0.87486 0.757376 )
( -40 -0.88858 0.643086 )
( -35 -0.8793 0.526652 )
( -30 -0.84502 0.411174 )
( -25 -0.78302 0.300466 )
( -24 -0.76702 0.27925 )
( -23 -0.75002 0.258448 )
( -22 -0.73188 0.238132 )
( -21 -0.71288 0.218316 )
( -20 -0.69188 0.199 )
( -19 -0.66974 0.18031 )
( -18 -0.64618 0.162502 )
( -17 -0.62134 0.145562 )
( -16 -0.5968 0.129734 )
( -15 -0.5727 0.115032 )
( -14 -0.5499 0.101414 )
( -13 -0.52682 0.089066 )
( -12 -0.50332 0.077788 )
( -11 -0.47954 0.067752 )
( -10 -0.45634 0.058958 )
( -8 -0.405283228699551 0.0477987085201794 )
( -6 -0.355066457399103 0.0332794170403588 )
( -5.5 -0.3419112 0.0295284 )
( -5 -0.3188888 0.02680848 )
( -4.5 -0.318356 0.02342464 )
( -4 -0.3095576 0.02063544 )
( -3.5 -0.2622032 0.01869416 )
( -3 -0.20598 0.024826 )
( -2.5 -0.13822 0.019738 )
( -2 -0.0769999999999999 0.016532 )
( -1.5 -0.01578 0.014078 )
( -1 0.04976 0.012206 )
( -0.5 0.11428 0.010862 )
( 0 0.18774 0.009666 )
( 0.5 0.25772 0.009852 )
( 1 0.32898 0.01008 )
( 1.5 0.3991 0.010222 )
( 2 0.46808 0.010336 )
( 2.5 0.53636 0.010508 )
( 3 0.60408 0.01058 )
( 3.5 0.66994 0.010624 )
( 4 0.73752 0.010696 )
( 4.5 0.80438 0.01091 )
( 5 0.87024 0.011038 )
( 5.5 0.93582 0.01118 )
( 6 1.0014 0.01135 )
( 6.5 1.06484 0.011734 )
( 7 1.127 0.012102 )
( 7.5 1.18988 0.012498 )
( 8 1.25062 0.013092 )
( 8.5 1.30736 0.01407 )
( 9 1.35666 0.015288 )
( 9.5 1.40954 0.01682 )
( 10 1.46002 0.018918 )
( 10.5 1.50578 0.021614 )
( 11 1.5497 0.024804 )
( 11.5 1.5866 0.029196 )
( 12 1.61834 0.034558 )
( 12.5 1.64966 0.041056 )
( 13 1.67382 0.0500340000000001 )
( 13.5 1.69194 0.0600000000000001 )
( 14.5 1.68676 0.0906960000000001 )
( 15 1.67678 0.110067 )
( 15.5 1.6654 0.129606 )
( 16 1.649 0.149922 )
( 16.5 1.6273 0.172138 )
( 17 1.60962 0.19358 )
( 17.5 1.58892 0.216212 )
( 18 1.5728 0.24287 )
( 19 1.57298 0.28359 )
( 19.5 1.57952 0.302878 )
( 20.5 1.59762 0.339844 )
( 21 1.5993 0.358252 )
( 22 1.60038 0.39614 )
( 23 1.59846 0.435056 )
( 24 1.59526 0.474714 )
( 25 1.59164 0.514942 )
( 26 1.58688 0.555584 )
( 28 1.57838 0.637264 )
( 30 1.57548 0.718282 )
( 32 1.58304 0.797338 )
( 35 1.5979 0.912842 )
( 40 1.58136 1.097928 )
( 45 1.51986 1.266578 )
( 50 1.41996 1.411856 )
( 55 1.28722 1.52784 )
( 60 1.12864 1.609648 )
( 65 0.95292 1.653968 )
( 70 0.7682 1.65883 )
( 75 0.58232 1.624604 )
( 80 0.40342 1.555054 )
( 85 0.2412 1.463286 )
( 90 0.10422 1.401832 )
( 95 -0.01864 1.403326 )
( 100 -0.1395 1.389734 )
( 105 -0.25736 1.361142 )
( 110 -0.37036 1.317764 )
( 115 -0.47622 1.260086 )
( 120 -0.57136 1.188722 )
( 125 -0.65536 1.10453 )
( 130 -0.7235 1.008824 )
( 135 -0.77464 0.90299 )
( 140 -0.80592 0.789028 )
( 145 -0.81506 0.669324 )
( 150 -0.79748 0.54675 )
( 155 -0.7519 0.424748 )
( 160 -0.67518 0.307734 )
( 170 -0.41602 0.109326 )
( 175 -0.22858 0.053688 )
( 180 0 0.04343 )
); // // // //
