OF21x/ALM22/constant/airfoilProperties/DU383-OF
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

airfoilData
(
//alpha   C_l      C_d

( -180 0 0.05357 )
( -175 0.2197 0.063372 )
( -170 0.39972 0.108932 )
( -160 0.64744 0.302358 )
( -155 0.72112 0.415928 )
( -150 0.76414 0.533902 )
( -145 0.77982 0.652412 )
( -140 0.7705 0.768058 )
( -135 0.73984 0.877972 )
( -130 0.68952 0.979854 )
( -125 0.62252 1.071904 )
( -120 0.54152 1.152654 )
( -115 0.44852 1.221004 )
( -110 0.34652 1.276054 )
( -105 0.23718 1.317104 )
( -100 0.1225 1.343886 )
( -95 0.00582000000000001 1.356 )
( -90 -0.11252 1.35348 )
( -85 -0.2292 1.336392 )
( -80 -0.34288 1.305036 )
( -75 -0.4509 1.259744 )
( -70 -0.55258 1.20115 )
( -65 -0.64394 1.129988 )
( -60 -0.72462 1.047256 )
( -55 -0.79064 0.954188 )
( -50 -0.84132 0.852284 )
( -45 -0.87434 0.743544 )
( -40 -0.88702 0.630034 )
( -35 -0.8767 0.514588 )
( -30 -0.84138 0.400306 )
( -25 -0.77938 0.291054 )
( -24 -0.76338 0.27015 )
( -23 -0.74638 0.249712 )
( -22 -0.72772 0.229708 )
( -21 -0.70872 0.210204 )
( -20 -0.68772 0.1912 )
( -19 -0.66506 0.17329 )
( -18 -0.63942 0.156938 )
( -17 -0.61146 0.142078 )
( -16 -0.5812 0.128746 )
( -15 -0.5493 0.117008 )
( -14 -0.5161 0.106666 )
( -13 -0.48158 0.097854 )
( -12 -0.44508 0.090372 )
( -11 -0.40726 0.084288 )
( -10 -0.36846 0.079602 )
( -8 -0.285995695067265 0.0751297219730941 )
( -6 -0.207491390134529 0.0548174439461883 )
( -5.5 -0.1895928 0.0487996 )
( -5 -0.1696072 0.04367312 )
( -4.5 -0.165164 0.03828416 )
( -4 -0.1550344 0.03300936 )
( -3.5 -0.1139408 0.02849304 )
( -3 -0.0796200000000001 0.027894 )
( -2.5 -0.0461800000000001 0.023222 )
( -2 -0.025 0.018508 )
( -1.5 -0.00382000000000001 0.015482 )
( -1 0.04144 0.013714 )
( -0.5 0.08932 0.012578 )
( 0 0.15706 0.010654 )
( 0.5 0.23068 0.010788 )
( 1 0.30662 0.01112 )
( 1.5 0.3809 0.011418 )
( 2 0.45352 0.011584 )
( 2.5 0.52284 0.011652 )
( 3 0.58952 0.01162 )
( 3.5 0.65486 0.011456 )
( 4 0.72088 0.011424 )
( 4.5 0.78722 0.01169 )
( 5 0.85256 0.011922 )
( 5.5 0.91658 0.01222 )
( 6 0.9806 0.01265 )
( 6.5 1.04196 0.013346 )
( 7 1.101 0.014338 )
( 7.5 1.15972 0.015462 )
( 8 1.21578 0.017148 )
( 8.5 1.26784 0.01953 )
( 9 1.31454 0.022672 )
( 9.5 1.36326 0.02618 )
( 10 1.40438 0.031242 )
( 10.5 1.44182 0.037266 )
( 11 1.4743 0.044876 )
( 11.5 1.5034 0.053324 )
( 12 1.53046 0.063002 )
( 12.5 1.55554 0.075064 )
( 13 1.57658 0.088046 )
( 13.5 1.59886 0.1016 )
( 14.5 1.62644 0.135624 )
( 15 1.63882 0.155073 )
( 15.5 1.6446 0.175314 )
( 16 1.649 0.195318 )
( 16.5 1.6507 0.217222 )
( 17 1.65278 0.23882 )
( 17.5 1.65548 0.260828 )
( 18 1.6612 0.28473 )
( 19 1.68062 0.32701 )
( 19.5 1.69288 0.348482 )
( 20.5 1.71878 0.389036 )
( 21 1.7267 0.408588 )
( 22 1.73922 0.44866 )
( 23 1.74874 0.489864 )
( 24 1.75594 0.531966 )
( 25 1.76116 0.574898 )
( 26 1.76472 0.618296 )
( 28 1.76922 0.706216 )
( 30 1.77412 0.794358 )
( 32 1.78376 0.881422 )
( 35 1.7981 1.009198 )
( 40 1.77584 1.212432 )
( 45 1.70134 1.395382 )
( 50 1.58324 1.549864 )
( 55 1.42918 1.66876 )
( 60 1.24616 1.746512 )
( 65 1.04548 1.779392 )
( 70 0.8358 1.76517 )
( 75 0.62808 1.704476 )
( 80 0.43098 1.602426 )
( 85 0.2568 1.476234 )
( 90 0.11618 1.393408 )
( 95 -0.00616000000000001 1.395994 )
( 100 -0.1265 1.383546 )
( 105 -0.24384 1.356098 )
( 110 -0.35684 1.313916 )
( 115 -0.46218 1.257434 )
( 120 -0.55784 1.187318 )
( 125 -0.64184 1.10427 )
( 130 -0.7105 1.009656 )
( 135 -0.76216 0.90481 )
( 140 -0.79448 0.791732 )
( 145 -0.80414 0.672756 )
( 150 -0.78812 0.55065 )
( 155 -0.7441 0.429012 )
( 160 -0.66842 0.311946 )
( 170 -0.41238 0.112394 )
( 175 -0.22702 0.063672 )
( 180 0 0.05357 )
); // // // //
